brents_squareBend4/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 500.0;

boundaryField
{
   inletFace
   {
     type fixedValue;
     value uniform 500.0;
   }
   inletWall
   {
     type zeroGradient;
   }
   inletsourceFace
   {
     type zeroGradient;
   }
   inletdestinationFace
   {
     type zeroGradient;
   }
   fineMeshWall
   {
     type zeroGradient;
   }
   fineMeshSourceFace
   {
     type zeroGradient;
   }
   fineMeshdestinationFace
   {
     type zeroGradient;
   }
   fineMeshSymmetryWall
   {
     type symmetryPlane;
   }
   fineMeshOutletLeft
   {
     type inletOutlet;
     value $internalField;
     inletValue $internalField;
   }
   fineMeshOutletBottom
   {
     type zeroGradient;
   }
}

// ************************************************************************* //
